src/benchmark.yml
config:
  target: 'http://localhost:8081'
  phases:
    - duration: 60
      arrivalRate: 10  

scenarios:
  - flow:
      - post:
          url: "/api/v1/heart-rate/save"
          json:
            ECG: 1500 # ✅ Valor fijo para pruebas
          headers:
            Content-Type: "application/json"
          expect:
            statusCode: 201